balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16F676.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="16xxxx" edc:desc="" edc:dsid="40039" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="PIC16F676" edc:procid="0x6676" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Import>
    <edc:Module_import edc:modsrc="16xxxx-NMMR.Module"/>
  </edc:Import>
  <edc:Power>
    <edc:VPP edc:defaultvoltage="13.000" edc:maxvoltage="13.250" edc:minvoltage="12.750"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="3.000" edc:minvoltage="2.500" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:erasealgo="4" edc:hasrowerasecmd="false" edc:lvpthresh="4.500" edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="2500" edc:eedata="6000" edc:erase="6000" edc:lvpgm="2500" edc:pgm="2000" edc:userid="2500"/>
    <edc:Latches edc:cfg="1" edc:eedata="1" edc:pgm="1" edc:userid="1"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="16xxxx" edc:name="16xxxx">
    <edc:MemTraits edc:hwstackdepth="8">
      <edc:CodeMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:CalDataMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:locsize="0x1" edc:wordimpl="0x7f" edc:wordinit="0x3fff" edc:wordsafe="0x7f" edc:wordsize="0x2"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x2" edc:unimplval="0" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x2100"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:Breakpoints edc:hasdatacapture="false" edc:hwbpcount="1" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x400" edc:issection="true" edc:regionid="page" edc:sectiondesc="ROM code space" edc:sectionname="PROG"/>
    <edc:CalDataZone edc:beginaddr="0x3ff" edc:endaddr="0x400" edc:issection="true" edc:regionid="oscval" edc:sectiondesc="Oscillator value" edc:sectionname="OSCVAL"/>
    <edc:UserIDSector edc:beginaddr="0x2000" edc:endaddr="0x2004" edc:issection="true" edc:regionid=".idlocs" edc:sectiondesc="ID locations" edc:sectionname="IDLOCS"/>
    <edc:TestZone edc:beginaddr="0x2000" edc:endaddr="0x2100" edc:regionid="testmem"/>
    <edc:DeviceIDSector edc:beginaddr="0x2006" edc:endaddr="0x2007" edc:issection="true" edc:mask="0x3fe0" edc:regionid=".device_id" edc:sectiondesc="Device ID" edc:sectionname="DEVICEID" edc:value="0x10e0"/>
    <edc:ConfigFuseSector edc:beginaddr="0x2007" edc:endaddr="0x2008" edc:regionid=".config">
      <edc:DCRDef edc:access="--nn---nnnnnnnnn" edc:cname="CONFIG" edc:default="0xffff" edc:desc="" edc:impl="0x31ff" edc:name="CONFIG" edc:nzwidth="0x10" edc:unimplval="1" edc:unused="0xe00" edc:useinchecksum="0x1ff">
        <edc:AliasList/>
        <edc:Illegal edc:desc="Current settings of PWRT and BOD are in conflict" edc:when="(reg &amp; 0x48) == 0x48"/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FOSC" edc:desc="Oscillator Selection bits" edc:mask="0x7" edc:name="FOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="EXTRCCLK" edc:desc="RC oscillator: CLKOUT function on RA4/OSC2/CLKOUT pin, RC on RA5/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x7">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_EXTRC_OSC_CLKOUT"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="EXTRCIO" edc:desc="RC oscillator: I/O function on RA4/OSC2/CLKOUT pin, RC on RA5/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x6">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_EXTRC_OSC_NOCLKOUT"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="INTRCCLK" edc:desc="INTOSC oscillator: CLKOUT function on RA4/OSC2/CLKOUT pin, I/O function on RA5/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x5">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_INTRC_OSC_CLKOUT"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="INTRCIO" edc:desc="INTOSC oscillator: I/O function on RA4/OSC2/CLKOUT pin, I/O function on RA5/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x4">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_INTRC_OSC_NOCLKOUT"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC: I/O function on RA4/OSC2/CLKOUT pin, CLKIN on RA5/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_EC_OSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS oscillator: High speed crystal/resonator on RA4/OSC2/CLKOUT and RA5/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_HS_OSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT oscillator: Crystal/resonator on RA4/OSC2/CLKOUT and RA5/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_XT_OSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="LP" edc:desc="LP oscillator: Low power crystal on RA4/OSC2/CLKOUT and RA5/OSC1/CLKIN" edc:when="(field &amp; 0x7) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_LP_OSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTE" edc:desc="Watchdog Timer Enable bit" edc:mask="0x1" edc:name="WDTE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT enabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_WDT_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT disabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_WDT_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PWRTE" edc:desc="Power-up Timer Enable bit" edc:mask="0x1" edc:name="PWRTE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWRT disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWRT enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="RA3/MCLR pin function select" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="RA3/MCLR pin function is MCLR" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RA3/MCLR pin function is digital I/O, MCLR internally tied to VDD" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOREN" edc:desc="Brown-out Detect Enable bit" edc:mask="0x1" edc:name="BOREN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="BOD enabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_BODEN"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="BOD disabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_BODEN_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protection bit" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Program Memory code protection is disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Program Memory code protection is enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_CP"/>
                </edc:AliasList>
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x20" edc:endaddr="0x3ff"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CPD" edc:desc="Data Code Protection bit" edc:mask="0x1" edc:name="CPD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data memory code protection is disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data memory code protection is enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_CPD"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="BG" edc:desc="Bandgap Calibration bits for BOD and POR voltage" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x3" edc:name="BG" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="3" edc:desc="Highest bandgap voltage" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="2" edc:desc="." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="1" edc:desc="." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="0" edc:desc="Lowest bandgap voltage" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:EEDataSector edc:beginaddr="0x2100" edc:endaddr="0x2180" edc:issection="true" edc:regionid="eedata" edc:sectiondesc="Data EEPROM" edc:sectionname="DEEPROM"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x2004" edc:endaddr="0x2005" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x100">
    <edc:RegardlessOfMode>
      <edc:NMMRPlace edc:regionid="corenmmrs">
        <edc:Module_ref edc:modsrc="16xxxx-NMMR.Module"/>
      </edc:NMMRPlace>
      <edc:SFRDataSector edc:bank="0" edc:beginaddr="0x0" edc:endaddr="0x20" edc:regionid="sfr0">
        <edc:SFRDef edc:access="--------" edc:cname="INDF" edc:desc="" edc:impl="0x0" edc:isindirect="true" edc:isvolatile="false" edc:mclr="--------" edc:name="INDF" edc:nzwidth="0x8" edc:por="--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDF" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="INDF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
